In [2]:
#Final Assighnment Intro To Data-Science
#Part-2: Python
#Name: Israel Yaacobovich
#ID: 212403679

In [3]:
#1

In [4]:
def conver(n):
    a = n
    
    digits = ['0','1','2','3','4','5','6','7','8','9','A','B','C','D','E','F']
    bin = ""
    while n > 0:
        bin = digits[n%2] + bin
        n //= 2
    n = a    
    
    oct = ""
    while n > 0:
        oct = digits[n%8] + oct
        n //= 8
    n = a    
    
    hex = ""
    while n > 0:
        hex = digits[n%16] + hex
        n //= 16
        
    print("bace2: " + bin)    
    print("bace8: " + oct)
    print("bace16: " + hex)

In [5]:
conver(10)

bace2: 1010
bace8: 12
bace16: A

In [6]:
#2

In [7]:
import pandas as pd
df = pd.read_csv('C:/Users/ישראל/DS/cast_dataset.csv')
df.head()

                               title  year       name   type character     n
0                    Suuri illusioni  1985     Homo $  actor    Guests  22.0
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself   NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27.0
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3.0
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself   NaN

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3333695 entries, 0 to 3333694
Data columns (total 6 columns):
 #   Column     Dtype
---  ------     -----
 0   title      object
 1   year       int64
 2   name       object
 3   type       object
 4   character  object
 5   n          float64
dtypes: float64(1), int64(1), object(4)
memory usage: 152.6+ MB

In [9]:
#Theier is a row for wach actor that played in the movie, so I got read of duplicates
df_single = df.drop_duplicates(['title', 'year'])

df_Hamlet = df_single.title == 'Hamlet'

df_Hamlet.sum()

17

In [10]:
#3

In [11]:
df_Treasure_Island = df_single.loc[df_single['title'] == 'Treasure Island']

df_Treasure_Island.sort_values('year')

,title,year,name,type,character,n
313097,Treasure Island,1918,Francis Carpenter,actor,Jim Hawkins,1.0
345942,Treasure Island,1920,Lon Chaney,actor,Blind Pew,5.0
8570,Treasure Island,1934,Robert Adair,actor,Tom - Seaman,NaN
12141,Treasure Island,1950,Chris Adcock,actor,Pike,26.0
38151,Treasure Island,1972,Cristino Almod?var,actor,O'Brien,18.0
484325,Treasure Island,1973,Richard Dawson,actor,Long John Silver,1.0
14899,Treasure Island,1985,Yves Afonso,actor,French captain,8.0
104905,Treasure Island,1999,Lance (II) Baker,actor,Frank,1.0

In [12]:
#4

In [13]:
df_Hamlet_actors = df.loc[df['title'] == 'Hamlet']

Hamlet_actors_1921 = df_Hamlet_actors.loc[df_Hamlet_actors['year'] == 1921]

len(Hamlet_actors_1921.index)

9

In [14]:
#5

In [26]:
# making a 'decade' column
df['decade'] = (df['year']//10)*10

#Apdating
df_single = df.drop_duplicates(['title', 'year'])

df_Hamlet = df_single.loc[df_single['title']  == 'Hamlet']

In [28]:
g = df_Hamlet.groupby('decade')

g.count().title

decade
1910    3
1920    1
1940    1
1950    1
1960    2
1970    2
1980    1
1990    2
2000    2
2010    2
Name: title, dtype: int64

In [170]:
#6

In [31]:
df_leading_roles = df.loc[df['n'] == 1]

leading_actors = df_leading_roles.loc[df_leading_roles['type'] == 'actor']
leading_actresses = df_leading_roles.loc[df_leading_roles['type'] == 'actress']

g1 = leading_actors.groupby('decade').get_group(1950).groupby('year')
g2 = leading_actresses.groupby('decade').get_group(1950).groupby('year')

In [32]:
print("for actors: ")
g1.count().title

for actors:

year
1950    604
1951    633
1952    591
1953    634
1954    626
1955    606
1956    614
1957    708
1958    694
1959    678
Name: title, dtype: int64

In [33]:
print("for actresses: ")
g2.count().title

for actresses:

year
1950    271
1951    272
1952    284
1953    290
1954    298
1955    264
1956    288
1957    284
1958    275
1959    287
Name: title, dtype: int64

In [212]:
#7

In [35]:
df_leading_roles_since_1990 = df_leading_roles.loc[df_leading_roles['year'] >= 1990]

g3 = df_leading_roles_since_1990.groupby('name')

g3.max().head(10).index

Index([''Chiyaan' Vikram', ''Cowboy' Matt Hopewell',
       ''Pook Diesel' Paul Watson', ''University' Jeevan', '2Meka Diaz',
       '50 Cent', '?caro Silva', '?ce Mrozek', '?d?m Lux',
       '?dgar (II) Ram?rez'],
      dtype='object', name='name')

In [224]:
#8

In [36]:
q = df.loc[df['name'] == "Frank Oz"].groupby('year').count()
q.loc[q['title'] > 1].index

Int64Index([1979, 1980, 1981, 1982, 1983, 1984, 1985, 1992, 1996, 1999, 2005], dtype='int64', name='year')